trunk/testfiles/set_parameter_attributes.xml

<?xml version="1.0"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
      <soap:Header>
        <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
      </soap:Header>
      <soap:Body>
        <cwmp:SetParameterAttributes>
  	<cwmp:ParameterList>
  	  <cwmp:SetParameterAttributesStruct>
  	    <cwmp:Name>.a.d</cwmp:Name>
  	    <cwmp:NotificationChange>1</cwmp:NotificationChange>
  	    <cwmp:Notification>2</cwmp:Notification>
  	    <cwmp:AccessListChange>1</cwmp:AccessListChange>
  	    <cwmp:AccessList>
  	      <xsd:string>Subscriber</xsd:string>
  	    </cwmp:AccessList>
  	  </cwmp:SetParameterAttributesStruct>
  	  <cwmp:SetParameterAttributesStruct>
  	    <cwmp:Name>.a.b.a</cwmp:Name>
  	    <cwmp:NotificationChange>0</cwmp:NotificationChange>
  	    <cwmp:Notification>1</cwmp:Notification>
  	    <cwmp:AccessListChange>1</cwmp:AccessListChange>
  	    <cwmp:AccessList>
  	    </cwmp:AccessList>
  	  </cwmp:SetParameterAttributesStruct>
  	  <cwmp:SetParameterAttributesStruct>
  	    <cwmp:Name>.a.c.2.d</cwmp:Name>
  	    <cwmp:NotificationChange>1</cwmp:NotificationChange>
  	    <cwmp:Notification>2</cwmp:Notification>
  	    <cwmp:AccessList>
  	    </cwmp:AccessList>
  	  </cwmp:SetParameterAttributesStruct>
  	</cwmp:ParameterList>
        </cwmp:SetParameterAttributes>
      </soap:Body>
  </soap:Envelope>
